from ultralytics import YOLO  # Импортираме класа YOLO от библиотеката Ultralytics

model = YOLO("yolo11s.pt")  # Зареждаме предварително обучен модел YOLO11s с готовите му тегла

results = model.train(       # Стартираме дообучаване (fine-tuning) на модела
    data="dataset/merilka-50ml/data.yaml",  # Път до YAML файла с класовете и тренировъчните/валидационните данни
    epochs=50,                    # Брой епохи — колко пъти моделът преминава през целия тренировъчен dataset
    imgsz=640,                    # Размер на изображенията за обучение (обикновено 640x640 пиксела)
    batch=4,                      # Брой изображения, обработвани заедно преди обновяване на теглата
    device="cpu",                 # Устройство за обучение: "cpu" = процесор, 0 = първата NVIDIA видеокарта
    project="runs",               # Главна директория, в която се записват резултатите от обучението
    name="products_v1"            # Име на конкретното обучение — резултатите ще са в runs/products_v1/
)